# StructuralSectionSlopedFlangeAngle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StructuralSectionSlopedFlangeAngle Property
ParameterTypeId Class See Also
---
"Sloped Flange Angle"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StructuralSectionSlopedFlangeAngle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StructuralSectionSlopedFlangeAngle As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StructuralSectionSlopedFlangeAngle {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace